GrandviewIoT/Industrial_IoT_Projects/boards/TI_Bds/msp430/user_api_MSP430_pin_map.h
/********1*********2*********3*********4*********5*********6*********7**********
*
*                             user_api_msp430_pin_map.h
*
*  Provide a higher level user API for newbies.
*  More experienced programmers can directly use the board_xxx calls
*  or the platform's DriverLib APIs.
*
*  See user_api.h in ~/boards/TI_Bds directory for more information
*
*  This provides the specific pin mapping for the Tiva 123G Launchpad.
*
* History:
*   07/11/15 - Created.  Duquaine
* -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -
*
* The MIT License (MIT)
*
* Copyright (c) 2014-2015 Wayne Duquaine / Grandview Systems
*
* Permission is hereby granted, free of charge, to any person obtaining a copy
* of this software and associated documentation files (the "Software"), to deal
* in the Software without restriction, including without limitation the rights
* to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
* copies of the Software, and to permit persons to whom the Software is
* furnished to do so, subject to the following conditions:
* 
* The above copyright notice and this permission notice shall be included in
* all copies or substantial portions of the Software.
* 
* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
* IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
* AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
* LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
* OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
* THE SOFTWARE.
*******************************************************************************/

#ifndef  __USER_API_BOARD_H__
#define  __USER_API_BOARD_H__


//*****************************************************************************
//*****************************************************************************
//                    LOGICAL  PIN  and  CHANNEL  MAPPINGS
//
// These supply an index to a port table, that contains the all the addresses
// used with the port, e.g.
//
//  index    Port Address entries
//    0    { P0OUT, P0IN, P0DIR, P0SEL0, P0SEL1. P0REN, P0IE, P0IFG, P0IES  }
//    1    { P1OUT, P1IN, P1DIR, P1SEL0, P1SEL1. P1REN, P1IE, P1IFG, P1IES  }
//    2    { P2OUT, P2IN, P2DIR, P2SEL0, P2SEL1. P2REN, P2IE, P2IFG, P2IES  }
//   ...       ...   ...    ...    ...     ...     ...  
//    6    { P6OUT, P6IN, P6DIR, P6SEL0, P6SEL1. P6REN, P6IE, P6IFG, P6IES }
//
// We then use the index to lookup the actual address from the above table.
//******************************************************************************
//******************************************************************************


#if defined(__MSP430F5529__)
//----------------------------------------------------------------------
//----------------------------------------------------------------------
//----------------------------------------------------------------------
//
//               MSP430 - F5529    Launchpad    GPIO/ADC/PWM  mappings
//
//----------------------------------------------------------------------
//----------------------------------------------------------------------
//----------------------------------------------------------------------

//     Logical
//     Pin number
//     to use in
//    your program   Physical Port and Pin number that pin corresponds to on MCU
//      ------      ------------------------------------------------------------
#define  Pin2         6,BIT5     /* P 6.5 top upper left J1 - on MSP430 F5529 */
#define  Pin3         3,BIT3     /* P 3.4  */
#define  Pin4         3,BIT3     /* P 3.3  */
#define  Pin5         1,BIT6     /* P 1.6  */
#define  Pin6         6,BIT6     /* P 6.6  */
#define  Pin7         3,BIT2     /* P 3.2  */
#define  Pin8         2,BIT7     /* P 2.7  */
#define  Pin9         4,BIT2     /* P 4.2  */
#define  Pin10        4,BIT1     /* P 4.1  */

#define  Pin11        3,BIT1     /* P 8.1  bottom lower right J2 */
#define  Pin12        5,BIT2     /* P 2.3  */
#define  Pin13        5,BIT6     /* P 2.6  */
#define  Pin14        1,BIT1     /* P 3.1  */
#define  Pin15        1,BIT0     /* P 3.0  */
//#define  Pin16      0,BIT0     /* no pin RESET */
#define  Pin17        5,BIT4     /* P 7.4  */
#define  Pin18        3,BIT2     /* P 2.2  */
#define  Pin19        2,BIT0     /* P 2.0  */
                        // note: pin  20 is Gnd (top upper right J2)

                        // note: pins 21 and 22 are VBUS and Gnd - top of J3
#define  Pin23        6,BIT0     /* P 6.0  */
#define  Pin24        6,BIT1     /* P 6.1  */
#define  Pin25        6,BIT2     /* P 6.2  */
#define  Pin26        6,BIT3     /* P 6.3  */
#define  Pin27        6,BIT4     /* P 6.4  */
#define  Pin28        7,BIT0     /* P 7.0  */
#define  Pin29        3,BIT6     /* P 3.6  */
#define  Pin30        3,BIT5     /* P 3.5  */

#define  Pin31        8,BIT1     /* P 8.2  bottom of J4 connector */
#define  Pin32        3,BIT7     /* P 3.7  */
#define  Pin33        4,BIT0     /* P 4.0  */
#define  Pin34        4,BIT3     /* P 4.3  */
#define  Pin35        1,BIT2     /* P 1.2  */
#define  Pin36        1,BIT3     /* P 1.3  */
#define  Pin37        1,BIT4     /* P 1.4  */
#define  Pin38        1,BIT5     /* P 1.5  */
#define  Pin39        2,BIT4     /* P 2.4  */
#define  Pin40        2,BIT5     /* P 2.5  top of J4 connector */

#define  LED1         1,BIT0     /* P 1.0 */
#define  LED2         4,BIT7     /* P 4.7 */
                                 // Grove  MCU    LP    Energia
#define  MAG_READ_SW1     1,BIT5   /* J15  P 1.5  J4-3   En 38 */
#define  FIXED_SLIDE_SW1  1,BIT3   /* J17  P 1.3  J4-5   En 36 */

//   Logical ADC
//   Channel number
//     to use in
//    your program   Physical Port and Channel that pin corresponds to on MCU
//      ------      ------------------------------------------------------------
                                     /*     associated   LP   Grove */
                                     /*     Energia Pin  Pin  Conn  */
#define  Adc0       ADC12INCH_0      /* P 6.0    23     J3-3   J5   */
#define  Adc1       ADC12INCH_1      /* P 6.1    24     J3-4   J6   */
#define  Adc2       ADC12INCH_2      /* P 6.2    25     J3-5   J7   */
#define  Adc3       ADC12INCH_3      /* P 6.3    26     J3-6   J8   */
#define  Adc4       ADC12INCH_4      /* P 6.4    27     J3-7   J9   */
#define  Adc5       ADC12INCH_5      /* P 6.5     2     J1-2    -   */
#define  Adc6       ADC12INCH_6      /* P 6.6     6     J1-6    -   */
#define  Adc12      ADC12INCH_12     /* P 7.0    28     J3-8    -   */

