GrandviewIoT/Industrial_IoT_Projects/boards/TI_Bds/msp430/user_api_MSP430_pin_map.h
#define  GROVE_J5   ADC12INCH_0      /* P 6.0    23     J3-3   J5   */
#define  GROVE_J6   ADC12INCH_1      /* P 6.1    24     J3-4   J6   */
#define  GROVE_J7   ADC12INCH_2      /* P 6.2    25     J3-5   J7   */
#define  GROVE_J8   ADC12INCH_3      /* P 6.3    26     J3-6   J8   */
#define  GROVE_J9   ADC12INCH_4      /* P 6.4    27     J3-7   J9   */


//  PWM
// -----
/*     Module 0:  TA0           Channel 1  CCR1   P 1.2    35     J4-6       */
/*                              Channel 2  CCR2   P 1.3    36     J4-5       */
/*                              Channel 3  CCR3   P 1.4    37     J4-4       */
/*                              Channel 4  CCR4   P 1.5    38     J4-3       */
/*     Module 1:  TA1           Channel 1  CCR1   P 2.0    19     J2-1       */
/*     Module 2:  TA2           Channel 1  CCR1   P 2.4    39     J4-2       */
/*                              Channel 2  CCR2   P 2.5    40     J4-1       */
#define  PWM_MODULE_0   0                   /* TA0   with CCRs 1,2,3,4       */
#define  PWM_MODULE_1   1                   /* TA1   with CCR  1             */
#define  PWM_MODULE_2   2                   /* TA2   with CCRs 1,2           */

#define  PWM_CHANNEL_1  1                   /* TA0.1  P 1.2  |  TA2.1  P 2.4 */
#define  PWM_CHANNEL_2  2                   /* TA0.2  P 1.3  |  TA2.2  P 2.5 */
#define  PWM_CHANNEL_3  3                   /* TA0.3  P 1.4  |               */
#define  PWM_CHANNEL_4  4                   /* TA0.4  P 1.5  |               */

#endif                          // (__MSP430F5529__)



#if defined(__MSP430FR6989__)
//----------------------------------------------------------------------
//----------------------------------------------------------------------
//----------------------------------------------------------------------
//
//                MSP430 - FR6989    Launchpad    GPIO/ADC/PWM  mappings
//
//----------------------------------------------------------------------
//----------------------------------------------------------------------
//----------------------------------------------------------------------

//     Logical
//    Pin number
//    to use in      -
//    your program   Physical Port and Pin number that pin corresponds to on MCU
//      ------      ------------------------------------------------------------
#define  Pin2         4,BIT2     /* P 4.2 top upper left J1 - on MSP430 FR5969*/
#define  Pin3         2,BIT6     /* P 2.6  J1-3 */      //  -- NEEDS REMAP - was copied from FR5969 --
#define  Pin4         2,BIT5     /* P 2.5  J1-4 */
#define  Pin5         4,BIT3     /* P 4.3  J1-5 */
#define  Pin6         2,BIT4     /* P 2.4  J1-6 */
#define  Pin7         2,BIT2     /* P 2.2  J1-7 */
#define  Pin8         3,BIT4     /* P 3.4  J1-8 */
#define  Pin9         3,BIT5     /* P 3.5  J1-9 */
#define  Pin10        3,BIT6     /* P 3.6  J1-10*/

#define  Pin11        1,BIT3     /* P 1.3  bottom lower right J2-10 */
#define  Pin12        1,BIT4     /* P 1.4  J2-9 */
#define  Pin13        1,BIT5     /* P 1.5  J2-8 */
#define  Pin14        1,BIT7     /* P 1.7  J2-7 */
#define  Pin15        1,BIT6     /* P 1.6  J2-6 */
//#define  Pin16      0,BIT0     /* no pin RESET */
#define  Pin17        0,BIT0     /*  n/c   J2-4 */
#define  Pin18        3,BIT0     /* P 3.0  J2-3 */
#define  Pin19        1,BIT2     /* P 1.2  J2-2 */
                        // note: pin  20 is Gnd (top upper right J2-1)

#define  LED1         1,BIT0     /* P 1.0  */
#define  LED2         9,BIT7     /* P 9.7  */


//   Logical ADC
//   Channel number
//     to use in
//    your program   Physical Port and Channel that pin corresponds to on MCU
//      ------      ------------------------------------------------------------
                                           /*       associated  LP   Grove */
                                           /*          Energia  Pin  Conn  */
                                           /* FR6989     Pin   Conn        */
                                           /* ------      --   ----   --   */
                                           /*   -         23   J3-3   J5   */
                                           /*   -         24   J3-4   J6   */
                                           /*   -         25   J3-5   J7   */
                                           /*   -         26   J3-6   J8   */
                                           /*   -         27   J3-7   J9   */

                        /* AD Ch   Pin   Energia   LP Conn   Grove  DRV Use */
#define  A2     0       /*  10     P9.2     2        J1-2           */
#define  A6     1       /*  11     P9.3     6        J1-6           */
#define  A17    2       /*  12     P9.4    17        J2-4           */
#define  A23    3       /*   7     P8.4    23        J3-3           */
#define  A24    4       /*   6     P8.5    24        J3-4           */
#define  A25    5       /*   5     P8.6    25        J3-5           */
#define  A26    6       /*   4     P8.7    26        J3-6           */
#define  A27    7       /*   8     P9.0    27        J3-7           */
#define  A28    8       /*   9     P9.1    28        J3-8           */
#define  A29    9       /*  13     P9.5    29        J3-9           */
#define  A30   10       /*  14     P9.6    30        J3-10          */
#define  A34   11       /*   3     P1.3    34        J4-7           */

/*#define  P7           /* TA1.0   P1.4     7        J1-7           */
#define  P8             /* TB0.6   P2.0     8        J1-8  - dup -  */
#define  P11            /* TA1.2   P4.7    11        J2-10 - dup -  */
#define  P12            /* TB0.3   P2.4    12        J2-9  - dup -  */
#define  P13            /* TB0.4   P2.5    13        J2-8  - dup -  */
#define  P14            /* TA0.2   P1.7    14        J2-7           */
#define  P15            /* TA0.1   P1.6    15        J2-6           */
/*#define  P18          /* TA0.0   P1.5    18        J2-3           */
#define  P19            /* TB0.5   P2.1    19        J2-2           */
#define  P34            /* TA1.2   P1.3    34        J4-7  -     -  */
#define  P35            /* TB0.4   P2.2    35        J4-6           */
#define  P36            /* TB0.3   P3.7    36        J4-5           */
#define  P37            /* TB0.2   P3.6    37        J4-4           */
#define  P38            /* TA1.1   P3.3    38        J4-3           */
#define  P39            /* TB0.5   P2.6    39        J4-2           */
#define  P40            /* TB0.6   P2.7    40        J4-1           */

