GrandviewIoT/Industrial_IoT_Projects/boards/TI_Bds/msp430/user_api_MSP430_pin_map.h
              //----------------------------------------
              // GROVE   Base Boosterpack   Pin Mapping
              //----------------------------------------
                //  ANALOG  I/O   Grove  Energia  LP    MCU Pin ADC
#define  GROVE_J5    A23       /*  J5     Pin23   J3-3   P 8.4   ADC12INCH_7 */
#define  GROVE_J6    A24       /*  J6     Pin24   J4-4   P 8.5   ADC12INCH_6 */
#define  GROVE_J7    A25       /*  J7     Pin25   J4-5   P 8.6   ADC12INCH_5 */
#define  GROVE_J8    A26       /*  J8     Pin26   J4-6   P 8.6   ADC12INCH_4 */
#define  GROVE_J9    A27       /*  J9     Pin27   J4-7   P 9.0   ADC12INCH_8 */

                //  DIGITAL I/O   Grove  Energia  LP    MCU Pin
#define  GROVE_J13   2,BIT7    /*  J13    Pin40   J4-1   P 2.7  */
#define  GROVE_J14   2,BIT6    /*  J14    Pin39   J4-2   P 2.6  */
#define  GROVE_J15   3,BIT3    /*  J15    Pin38   J4-3   P 3.3  */
#define  GROVE_J16   3,BIT6    /*  J16    Pin37   J4-4   P 3.6  */
#define  GROVE_J17   3,BIT7    /*  J17    Pin36   J4-5   P 3.7  */

                           // GPIO   ADC 12 Chan   Energia   Launchpd  Grove
#define  GROVE_J5   A23    /* P 8.4  ADC12INCH_7    A23 23     J3-3     J5 */
#define  GROVE_J6   A24    /* P 8.5  ADC12INCH_6    A24 24     J3-4     J6 */
#define  GROVE_J7   A25    /* P 8.6  ADC12INCH_5    A25 25     J3-5     J7 */
#define  GROVE_J8   A26    /* P 8.7  ADC12INCH_4    A26 26     J3-6     J8 */
#define  GROVE_J9   A27    /* P 9.0  ADC12INCH_8    A27 27     J3-7     J9 */


            //-----------------------------------------
            //           ADC Trigger Values
            //-----------------------------------------
            //         values for MSP430-FR6989
#define  ADC_TRIGGER_TIMER_0_CC1  0x0001  /* Timer TA0 CCR 1 match is trigger source TA0/CCR1 */
#define  ADC_TRIGGER_TIMER_4_CC0  0x0002  /* Timer TB0 CCR 0 match is trigger source TB0/CCR0 */
#define  ADC_TRIGGER_TIMER_4_CC0  0x0003  /* Timer TB0 CCR 1 match is trigger source TB0/CCR1 */
#define  ADC_TRIGGER_TIMER_1_CC1  0x0004  /* Timer TA1 CCR 2 match is trigger source TA1/CCR1 */
#define  ADC_TRIGGER_TIMER_2_CC1  0x0005  /* Timer TA2 CCR 1 match is trigger source TA2/CCR1 */
#define  ADC_TRIGGER_TIMER_3_CC1  0x0006  /* Timer TA3 CCR 1 match is trigger source TA3/CCR1 */


//  PWM
// -----                            -- need to re-work pins - copied from FR5969
/*     Module 0:  TA0           Channel 1  CCR1   P 1.2   Pin19   J2-2        */
/*                              Channel 2  CCR2   P 1.3   Pin11   J2-10       */
/*     Module 1:  TA1           Channel 1  CCR1   P 1.2   Pin19   J2-2    ?   */
/*                              Channel 2  CCR2   P 1.3   Pin11   J2-10   ?   */
/*     Module 4:  TB0           Channel 2  CCR2   P 1.5   Pin13   J2-8        */
/*                              Channel 3  CCR3   P 3.4   Pin8    J1-8        */
/*                              Channel 4  CCR4   P 3.5   Pin9    J1-9        */
/*                              Channel 5  CCR5   P 3.6   Pin10   J1-10       */
/*                              Channel 6  CCR1   P 1.4   Pin12   J2-9        */
/*                                                                            */
/*    CAUTION: several TB0.x pins overlap with the SPI pins, so we do _NOT_   */
/*             hook them up (P1.6, P1.7, P2.2).                               */
/*             So many projects use SPI (CC3100, DRV8xxx, ...) that it would  */
/*             be too easy to shoot oneself in the foot, so we don't use them.*/
/*             Ditto for TA0.1 and TA1.0  (MOSI/MISO conflicts)               */

#define  PWM_MODULE_0   0                   /* TA0   with CCRs 1,2   [0,3]    */
#define  PWM_MODULE_1   1                   /* TA1   with CCRs 1,2   [0,3]    */
#define  PWM_MODULE_2   2                   /* TA2      TIMER ONLY  no GPIOs  */
#define  PWM_MODULE_3   3                   /* TA3      TIMER ONLY  no GPIOs  */
#define  PWM_MODULE_4   4                   /* TB0   with CCRs [0,1],2,3,4,5,6 */
                                              // -- needs work copied from FR5969
                              /* PWM_MODULE_0  | PWM_MODULE_1  |  PWM_MODULE_4 */
                              /* ------------- | ------------- |  ------------ */
#define  PWM_CHANNEL_1  1     /* TA0.1         | TA1.1  P 1.2  |-not pinned out-*/
#define  PWM_CHANNEL_2  2     /* TA0.2         | TA1.2  P 1.3  |  TB0.2  P 1.5 */
#define  PWM_CHANNEL_3  3     /*      -        |      -        |  TB0.3  P 3.4 */
#define  PWM_CHANNEL_4  4     /*      -        |      -        |  TB0.4  P 3.5 */
#define  PWM_CHANNEL_5  5     /*      -        |      -        |  TB0.5  P 3.6 */
#define  PWM_CHANNEL_6  6     /*      -        |      -        |  TB0.6  P 3.6 */

#endif                          // defined(__MSP430FR6989__)



#if defined(__MSP430FR5969__)
//----------------------------------------------------------------------
//----------------------------------------------------------------------
//----------------------------------------------------------------------
//
//                MSP430 - FR5969    Launchpad    GPIO/ADC/PWM  mappings
//
// CAUTION:  as per the Grove Launchpad documentation, Grove
//           ADC connectors J5-J9 only connect to the pins on the
//           Launchpad inner connector J3  (logical pins 23-27).
//
//           So on "single-row devices like the FR5969,
//           you need to add female-to-female jumpers, that will
//           jumper from the Grove J3 connector pins 23-27 over to the
//           Launchpad J2 or J1 connectors.
//
//           In this example, I have jumpered them over to the
//           FR5969 ADC Channels A10, A7, A3, A4, and A5,  which map to
//           the Launchpad J1-2, J1-6, J2-10, J2-9, and J2-8
//           connector pins respectively.
//
//           You may choose a different mapping for your application,
//           by modifing the GROVE_J5 - Grove_J9 definitions below.
//----------------------------------------------------------------------
//----------------------------------------------------------------------
//----------------------------------------------------------------------

//     Logical
//    Pin number
//    to use in
//    your program   Physical Port and Pin number that pin corresponds to on MCU
//      ------      ------------------------------------------------------------
#define  Pin2         4,BIT2     /* P 4.2 top upper left J1 - on MSP430 FR5969*/
#define  Pin3         2,BIT6     /* P 2.6  J1-3 */
#define  Pin4         2,BIT5     /* P 2.5  J1-4 */
#define  Pin5         4,BIT3     /* P 4.3  J1-5 */
#define  Pin6         2,BIT4     /* P 2.4  J1-6 */
#define  Pin7         2,BIT2     /* P 2.2  J1-7 */
#define  Pin8         3,BIT4     /* P 3.4  J1-8 */
#define  Pin9         3,BIT5     /* P 3.5  J1-9 */
#define  Pin10        3,BIT6     /* P 3.6  J1-10*/

#define  Pin11        1,BIT3     /* P 1.3  bottom lower right J2-10 */
#define  Pin12        1,BIT4     /* P 1.4  J2-9 */
#define  Pin13        1,BIT5     /* P 1.5  J2-8 */
#define  Pin14        1,BIT7     /* P 1.7  J2-7 */
#define  Pin15        1,BIT6     /* P 1.6  J2-6 */
//#define  Pin16      0,BIT0     /* no pin RESET */
#define  Pin17        0,BIT0     /*  n/c   J2-4 */
#define  Pin18        3,BIT0     /* P 3.0  J2-3 */
#define  Pin19        1,BIT2     /* P 1.2  J2-2 */
                        // note: pin  20 is Gnd (top upper right J2-1)


#define  LED1         4,BIT6     /* P 4.6  */
#define  LED2         1,BIT0     /* P 1.0  */

                                  // ALL GROVE CONNECTS MUST BE RE-MAPPED ON FR5969
                                  // Grove  MCU    LP   REMAP  Energia
#define  MAG_READ_SW1     2,BIT6    /* J15  P 2.6  J4-3 -> J1-3    En 3 */
#define  FIXED_SLIDE_SW1  4,BIT3    /* J17  P 4.3  J4-5 -> J1-5    En 5 */


//   Logical ADC
//   Channel number
//     to use in
//    your program   Physical Port and Channel that pin corresponds to on MCU
//      ------      ------------------------------------------------------------
                                           /*       associated  LP   Grove */
                                           /*          Energia  Pin  Conn  */
                                           /* FR5969     Pin   Conn        */
                                           /* ------      --   ----   --   */
                                           /*   -         23   J3-3   J5   */
                                           /*   -         24   J3-4   J6   */
                                           /*   -         25   J3-5   J7   */
                                           /*   -         26   J3-6   J8   */
                                           /*   -         27   J3-7   J9   */

