GrandviewIoT/Industrial_IoT_Projects/boards/TI_Bds/msp430/user_api_MSP430_pin_map.h
                             /*     Energia Launchpad conn */
                             /*        Pin   J1/J2 */
                             /*        ---   ----- */
#define  Adc2        0       /* P 1.2 ADC12INCH_2  19   J2-2  */
#define  Adc3        1       /* P 1.3 ADC12INCH_3  11   J2-10 */
#define  Adc4        2       /* P 1.4 ADC12INCH_4  12   J2-9  */
#define  Adc5        3       /* P 1.5 ADC12INCH_5  13   J2-8  */
#define  Adc7        4       /* P 2.4 ADC12INCH_7   6   J1-6  */
#define  Adc10       5       /* P 4.2 ADC12INCH_10  2   J1-2  */
#define  Adc11       6       /* P 4.3 ADC12INCH_11  5   J1-5  */
#define  Adc12       7       /* P 3.0 ADC12INCH_12 18   J2-3  */

                             // ALL GROVE CONNECTS MUST BE RE-MAPPED ON FR5969
                             // GPIO  ADC 12 Chan    J1/J2    Jumpers     Grove
#define  GROVE_J5   Adc10    /* P 4.2 ADC12INCH_10  A2   2   J3-3 -> J1-2   J5 */
#define  GROVE_J6   Adc7     /* P 2.4 ADC12INCH_7   A7   6   J3-4 -> J1-6   J6 */
#define  GROVE_J7   Adc3     /* P 1.3 ADC12INCH_3  A11  11   J3-5 -> J2-10  J7 */
#define  GROVE_J8   Adc4     /* P 1.4 ADC12INCH_4  A12  12   J3-6 -> J2-9   J8 */
#define  GROVE_J9   Adc5     /* P 1.5 ADC12INCH_5  A13  13   J3-7 -> J2-8   J9 */


//  PWM
// -----
/*     Module 1:  TA1           Channel 1  CCR1   P 1.2    19     J2-2        */
/*                              Channel 2  CCR2   P 1.3    11     J2-10       */
/*     Module 4:  TB0           Channel 1  CCR1   P 1.4    12     J2-9        */
/*                              Channel 2  CCR2   P 1.5    13     J2-8        */
/*                              Channel 3  CCR3   P 3.4     8     J1-8        */
/*                              Channel 4  CCR4   P 3.5     9     J1-9        */
/*                              Channel 5  CCR5   P 3.6    10     J1-10       */
/*                                                                            */
/*    CAUTION: several TB0.x pins overlap with the SPI pins, so we do _NOT_   */
/*             hook them up (P1.6, P1.7, P2.2).                               */
/*             So many projects use SPI (CC3100, DRV8xxx, ...) that it would  */
/*             be too easy to shoot oneself in the foot, so we don't use them.*/
/*             Ditto for TA0.1 and TA1.0  (MOSI/MISO conflicts)               */
  
#define  PWM_MODULE_1   1                    /* TA1   with CCRs 1,2         */
#define  PWM_MODULE_4   4                    /* TB0   with CCRs 1,2,3,4,5     */

                                             /* PWM_MODULE_1  |  PWM_MODULE_4 */
                                             /* ------------- |  ------------ */
#define  PWM_CHANNEL_1  1                    /* TA1.1  P 1.2  |  TB0.1  P 1.4 */
#define  PWM_CHANNEL_2  2                    /* TA1.2  P 1.3  |  TB0.2  P 1.5 */
#define  PWM_CHANNEL_3  3                    /*               |  TB0.3  P 3.4 */
#define  PWM_CHANNEL_4  4                    /*               |  TB0.4  P 3.5 */
#define  PWM_CHANNEL_5  5                    /*               |  TB0.5  P 3.6 */

#endif                          // defined(__MSP430FR5969__)



#if defined(__MSP430FR4133__)
//----------------------------------------------------------------------
//----------------------------------------------------------------------
//----------------------------------------------------------------------
//
//                MSP430 - FR4133    Launchpad    GPIO/ADC/PWM  mappings
//
// CAUTION:  as per the Grove Launchpad documentation, Grove
//           ADC connectors J5-J9 only connect to the pins on the
//           Launchpad inner connector J3  (logical pins 23-27).
//
//           So on "single-row devices like the FR4133,
//           you need to add female-to-female jumpers, that will
//           jumper from the Grove J3 connector pins 23-27 over to the
//           Launchpad J2 or J1 connectors.
//
//           In this example, I have jumpered them over to the
//           FR5969 ADC Channels A2, A3, A4, A5, and A10 which map to
//           the Launchpad J2-2, J2-10, J2-9, J2-8, and J1-2
//           connector pins respectively.
//
//           You may choose a different mapping for your application,
//           by modifing the GROVE_J5 - Grove_J9 definitions below.
//----------------------------------------------------------------------
//----------------------------------------------------------------------
//----------------------------------------------------------------------

//     Logical
//    Pin number
//    to use in
//    your program   Physical Port and Pin number that pin corresponds to on MCU
//      ------      ------------------------------------------------------------
#define  Pin2         8,BIT1     /* P 8.1 top upper left J1 - on MSP430 FR4133*/
#define  Pin3         1,BIT1     /* P 1.1  J1-3 */
#define  Pin4         1,BIT0     /* P 1.0  J1-4 */
#define  Pin5         2,BIT7     /* P 2.7  J1-5 */
#define  Pin6         8,BIT0     /* P 8.0  J1-6 */
#define  Pin7         5,BIT1     /* P 5.1  J1-7 */
#define  Pin8         2,BIT5     /* P 2.5  J1-8 */
#define  Pin9         8,BIT2     /* P 8.2  J1-9 */
#define  Pin10        8,BIT3     /* P 8.3  J1-10*/

#define  Pin11        1,BIT5     /* P 1.5  bottom lower right J2-10 */
#define  Pin12        1,BIT4     /* P 1.4  J2-9 */
#define  Pin13        1,BIT3     /* P 1.3  J2-8 */
#define  Pin14        5,BIT3     /* P 5.3  J2-7 */
#define  Pin15        5,BIT2     /* P 5.2  J2-6 */
//#define  Pin16      0,BIT0     /* no pin RESET */
#define  Pin17        5,BIT0     /* P 5.0  J2-4 */
#define  Pin18        1,BIT6     /* P 1.6  J2-3 */
#define  Pin19        1,BIT7     /* P 1.7  J2-2 */
                        // note: pin  20 is Gnd (top upper right J2-1)


#define  LED1         1,BIT0     /* P 1.0  ->  CLOBBERS  UART TX */
#define  LED2         4,BIT0     /* P 4.0          */

                                  // ALL GROVE CONNECTS MUST BE RE-MAPPED ON FR5969
                                  // Grove  MCU    LP   REMAP  Energia
#define  MAG_READ_SW1     1,BIT1    /* J15  P 1.1  J4-3 -> J1-3    En 3 */
#define  FIXED_SLIDE_SW1  2,BIT7    /* J17  P 2.7  J4-5 -> J1-5    En 5 */


//   Logical ADC
//   Channel number
//     to use in
//    your program   Physical Port and Channel that pin corresponds to on MCU
//      ------      ------------------------------------------------------------
                                           /*       associated  LP   Grove */
                                           /*          Energia  Pin  Conn  */
                                           /* FR4133     Pin   Conn        */
                                           /* ------     ---   ----   --   */
                                           /*   -         23   J3-3   J5   */
                                           /*   -         24   J3-4   J6   */
                                           /*   -         25   J3-5   J7   */
                                           /*   -         26   J3-6   J8   */
                                           /*   -         27   J3-7   J9   */

                             /*               Energia Launchpad conn */
                             /*                  Pin   J1/J2 */
                             /*                  ---   ----- */
#define  Adc0        0       /* P 1.0  ADCINCH_0   4   J1-4  -> LED1 CONFLICT ! */
#define  Adc1        1       /* P 1.1  ADCINCH_1   3   J1-3  */
#define  Adc3        2       /* P 1.3  ADCINCH_3  13   J2-8  */
#define  Adc4        3       /* P 1.4  ADCINCH_4  12   J2-9  */
#define  Adc5        4       /* P 1.5  ADCINCH_5  11   J2-10 */
#define  Adc6        5       /* P 1.6  ADCINCH_6  18   J2-3  */
#define  Adc7        6       /* P 1.7  ADCINCH_7  19   J2-2  */
#define  Adc8        7       /* P 8.0  ADCINCH_8   6   J1-6  */
#define  Adc9        8       /* P 8.1  ADCINCH_9   2   J1-2  */

                             // ALL GROVE CONNECTS MUST BE RE-MAPPED ON FR4133
                             // GPIO  ADC 10 Chan    J1/J2    Jumpers     Grove
#define  GROVE_J5   Adc9     /* P 8.1  ADCINCH_9    A2   2   J3-3 -> J1-2   J5 */
#define  GROVE_J6   Adc8     /* P 8.0  ADCINCH_8    A6   6   J3-4 -> J1-6   J6 */
#define  GROVE_J7   Adc5     /* P 1.5  ADCINCH_5   A11  11   J3-5 -> J2-10  J7 */
#define  GROVE_J8   Adc4     /* P 1.4  ADCINCH_4   A12  12   J3-6 -> J2-9   J8 */
#define  GROVE_J9   Adc3     /* P 1.3  ADCINCH_3   A13  13   J3-7 -> J2-8   J9 */


