GrandviewIoT/Industrial_IoT_Projects/boards/TI_Bds/msp430/user_api_MSP430_pin_map.h
//  PWM
// -----
/*     Module 0:  TA0           Channel 1  CCR1   P 1.7    19     J2-2        */
/*                              Channel 2  CCR2   P 1.6    18     J2-3        */
#define  PWM_MODULE_0   0                      /* TA0   with CCRs 1,2         */

#define  PWM_CHANNEL_1  1                      /* TA0.1  P 1.7                */
#define  PWM_CHANNEL_2  2                      /* TA0.2  P 1.6                */

#endif                          // defined(__MSP430FR4133__)



#if defined(__MSP430G2553__)
//----------------------------------------------------------------------
//----------------------------------------------------------------------
//----------------------------------------------------------------------
//
//              MSP430 - G2553    Launchpad    GPIO/ADC/PWM  mappings
//
//----------------------------------------------------------------------
//----------------------------------------------------------------------
//----------------------------------------------------------------------

#define  LED1         1,BIT0     /* P 1.0  ->  CLOBBERS  UART TX and Adc0 */
//#define  LED2         4,BIT0     /* P 4.0          */

                                  // ALL GROVE CONNECTS MUST BE RE-MAPPED ON FR5969
                                  // Grove  MCU    LP   REMAP  Energia
#define  MAG_READ_SW1     1,BIT1    /* J15  P 1.1  J4-3 -> J1-3    En 3 */
#define  FIXED_SLIDE_SW1  2,BIT7    /* J17  P 2.7  J4-5 -> J1-5    En 5 */


//   Logical ADC
//   Channel number
//     to use in
//    your program   Physical Port and Channel that pin corresponds to on MCU
//      ------      ------------------------------------------------------------

// ADC's listed by "Energia Pin" Number
// ------------------------------------
#define  A2        Adc_Chan_0
#define  A3        Adc_Chan_1
#define  A4        Adc_Chan_2
#define  A5        Adc_Chan_3
#define  A6        Adc_Chan_4
#define  A7        Adc_Chan_5
#define  A14       Adc_Chan_6
#define  A15       Adc_Chan_7

// ADC's listed by Channel Number                Energia  Launchpad connector
// ------------------------------                  Pin    J1/J2
                               //                   ---   -----
#define  Adc_Chan_0     0      /* P 1.0  ADCINCH_0   A2   J1-2  -> LED1 CONFLICT ! */
#define  Adc_Chan_1     1      /* P 1.1  ADCINCH_1   A3   J1-3  */
#define  Adc_Chan_2     2      /* P 1.2  ADCINCH_2   A4   J1-4  */
#define  Adc_Chan_3     3      /* P 1.3  ADCINCH_3   A5   J1-5  */
#define  Adc_Chan_4     4      /* P 1.4  ADCINCH_4   A6   J1-6  */
#define  Adc_Chan_5     5      /* P 1.5  ADCINCH_5   A7   J1-7  */
#define  Adc_Chan_6     6      /* P 1.6  ADCINCH_6  A14   J2-7  */
#define  Adc_Chan_7     7      /* P 1.7  ADCINCH_7  A15   J2-6  */

                               // ALL GROVE CONNECTS MUST BE RE-MAPPED ON F2553
                               // GPIO  ADC 10 Chan    J1/J2      Jumpers     Grove
#define  GROVE_J5  Adc_Chan_2  /* P 1.2  ADCINCH_2    A2   2   J3-3 -> J1-4 <- J5  */
#define  GROVE_J6  Adc_Chan_4  /* P 1.4  ADCINCH_4    A6   6   J3-4 -> J1-6    J6  */
#define  GROVE_J7  Adc_Chan_3  /* P 1.3  ADCINCH_3    A5   5   J3-5 -> J1-5    J7  */
#define  GROVE_J8  Adc_Chan_7  /* P 1.7  ADCINCH_7   A15  15   J3-6 -> J2-6    J8  */
#define  GROVE_J9  Adc_Chan_6  /* P 1.6  ADCINCH_6   A14  14   J3-7 -> J2-7    J9  */


// PWM's listed by "Energia Pin" Number
// ------------------------------------
#define  P0       PWM_CHANNEL_0
#define  P1       PWM_CHANNEL_1
#define  P2       PWM_CHANNEL_2
#define  P0A      PWM_CHANNEL_0A
#define  P1A      PWM_CHANNEL_1A
#define  P2A      PWM_CHANNEL_2A

//  PWM
// -----                                         Default Pins
/*     Module 1:  TA1           Channel 0  CCR1   P 2.0     8     J1-8        */
/*                              Channel 1  CCR1   P 2.1     9     J1-9        */
/*                              Channel 2  CCR2   P 2.4    12     J2-9        */
#define  PWM_MODULE_1    1                     /* TA1   with CCRs 0,1,2       */


// PWM's listed by Channel Number
// ------------------------------------
   // Note that on G2553, the TA1.0/TA1.1/TA1.2 pins can be routed out to alternate
   //      pins. If you want to route out the alternate pins then specify
   //      PWM_CHANNEL_1A and/or PWM_CHANNEL_2A to utilize the alternative pins
#define  PWM_CHANNEL_0   0                     /* TA1.0  P 2.0                */
#define  PWM_CHANNEL_1   1                     /* TA1.1  P 2.1                */
#define  PWM_CHANNEL_2   2                     /* TA1.2  P 2.4                */
#define  PWM_CHANNEL_0A  3                     /* TA1.0  P 2.3                */
#define  PWM_CHANNEL_1A  4                     /* TA1.1  P 2.2                */
#define  PWM_CHANNEL_2A  5                     /* TA1.2  P 2.5                */

                         // optional flags on board_pwm_config_channel() call
#define  PWM_STANDARD_PWM   0       /* standard PWM, CCR0 = period (OUTMOD_7) */
#define  PWM_TOGGLE_OUTPUT  1       /* quasi-PWM - toggle outputs  (OUTMOD_4) */

#endif                   // defined(__MSP430G2553__)


#if defined(__MSP430G2553__)
                   // provide defs for F2553 DriverLib emulation routines
void GPIO_setOutputHighOnPin (uint16_t gpio_port_id,  uint16_t pin);
void GPIO_setOutputLowOnPin (uint16_t gpio_port_id,  uint16_t pin);
void GPIO_toggleOutputOnPin (uint16_t gpio_port_id,  uint16_t pin);
int GPIO_getInputPinValue (uint16_t gpio_port_id,  uint16_t pin);
#endif

//******************************************************************************
//******************************************************************************
//                  LOW LEVEL MAPPING OF GPIO PIN calls on MSP430
//******************************************************************************
//******************************************************************************

// 06/02/15 - Engineers think in Ports.  DIY-ers think in pins (due to Arduino).
//            Probably need a set_logical_pin/get_logical_pin/toggle_logical_pin
//            API for DIY-ers. But make it "pin at a time" or you will go crazy
//            trying to convert each bit into different port/pin combos.
//            Too bad- you want speed - use ports !

