GrandviewIoT/Industrial_IoT_Projects/boards/TI_Bds/msp430/user_api_MSP430_pin_map.h
inline void   inline_pins_High (int gpio_port_id,  unsigned long pins_mask)
{
    GPIO_setOutputHighOnPin (gpio_port_id, pins_mask);  // sets one or more pins high
}

inline void   inline_pins_Low (int gpio_port_id,   unsigned long pins)
{
    GPIO_setOutputLowOnPin (gpio_port_id, pins);   // sets one or more pins low
}

inline void   inline_pins_Toggle (int gpio_port_id,  unsigned long pins)
{
    GPIO_toggleOutputOnPin (gpio_port_id, pins);   // toggles one or more pins
}

inline int   inline_pins_Read (uint16_t gpio_port_id,  uint16_t pins)
{
    return (GPIO_getInputPinValue(gpio_port_id, pins));  // reads one or more pins
}

inline int   inline_pin_Value (uint16_t gpio_port_id,  uint16_t pins)
{
    return (GPIO_getInputPinValue(gpio_port_id, pins));  // reads one or more pins
}

inline void  inline_set_pins_Output (uint16_t gpio_port_id,  uint16_t pins)
{
    GPIO_setAsOutputPin (gpio_port_id, pins);   // set one or more pins on port to output
}

inline void  inline_set_pins_Input (uint16_t gpio_port_id,  uint16_t pins)
{
    GPIO_setAsInputPin (gpio_port_id, pins);   // set one or more pins on port to input
}

// This needs more thinking - should really be "Configure ADC Channel" that does both GPIO and ADC setup
// In that case, it can only be done "pin at a time", else gets too nuts.
inline int   inline_set_pins_Analog (uint16_t gpio_port_id,  uint16_t pins)
{
    // not such function as GPIO_setAsAnalogPin() in DriverLib !!! // set one or more pins on port to Analog
}

#endif                             //  __USER_BOARD_API_H__
